app/controllers/pages_controller.rb

SELECT "users".* FROM "users"
---
  def dashboard
  @user = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def become_admin
    @user = User.find(params[:format])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def become_visit
    @user = User.find(params[:format])